AcGiDrawableReactor.added(AcGiDrawable*,System.Int64,System.Int64)
This event signals the addition of a drawable's graphics.
pDrawable: Input drawable whose graphics were added.
parentID: Input id of parent drawable.
databasePtr: Input database pointer cast as LONG_PTR.

AcGiDrawableReactor.modified(AcGiDrawable*,System.Int64)
This event signals the modification of a drawable's graphics.
pDrawable: Input drawable whose graphics were modified.
parentID: Input id of parent drawable.

AcGiDrawableReactor.erased(AcGiDrawable*,System.Int64)
This event signals the erasure of a drawable's graphics.
pDrawable: Input drawable whose graphics were erased.
parentID: Input id of parent drawable.

AcGiDrawableReactor.handOverTo(AcGiDrawable*,AcGiDrawable*)
This event signals graphics are being handed over from one drawable to another drawable.
pDrawableFrom: Input drawable from which graphics will be handed over.
pDrawableTo: Input drawable to which graphics will be handed over.

AcGiDrawableReactor.erased(AcGiDrawable*)
This event signals the erasure of a drawable's graphics.
pDrawable: Input drawable whose graphics were erased.

AcGiDrawableReactor.modified(AcGiDrawable*)
This event signals the modification of a drawable's graphics.
pDrawable: Input drawable whose graphics were modified.

AcGiDrawableReactor.endRegen(AcGiDrawable*,AcGiDrawableReactor.RegenFlags)
This event signals the end of a drawable's regen.
pDrawable: Input drawable that was regenerated.
flags: Input graphics system that performed the regen.

AcGiDrawableReactor.beginRegen(AcGiDrawable*,AcGiDrawableReactor.RegenFlags)
This event signals the beginning of a drawable's regen.
pDrawable: Input drawable about to be regenerated.
flags: Input graphics system that will perform the regen.

AcGiDrawableReactor
AcGiDrawableReactor provides notifications of key AcGiDrawable-
related events including begin/end regen, modification, and
erasure. Clients who derive from this class will receive these
events after registering their reactor with
acgiDrawableEvent->addReactor().